Wexter/ESP32-Motronic-4.1-K-Line-diagnostics/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.2.1 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_BT_ENABLED=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
CONFIG_UART_ISR_IN_IRAM=y
CONFIG_FREERTOS_HZ=1000
CONFIG_OPENTHREAD_RX_ON_WHEN_IDLE=y
